---
layout: post
title: "解决因无线路由器频段导致的MacBook Air不能连上无线的问题"
description: ""
category: 工具
tags: [Mac Tips]
---
{% include JB/setup %}

####前言

只从买了MacBook Air后，发现了一个诡异的问题，即在同一个无线网络环境下，我的手机等设备都能连接上网络，但是我的MacBook Air却无法连接网络，但是在偶尔烧高香的情况下，也能连上，但是一旦不小心断网之后，再想连接网络简直比登天还难。

####问题

为什么会出现这种手机能够正常连接而MacBook Air却无法连接网络的情况呢？


####解决方案

原因：

其实出现这个问题是由路由器的频段（信道）引起的，一般路由器的无线都会有13个频段，其默认情况下使用的是自动频段，而普通的手机、笔记本都支持这13个频段，但MacBook Air却不知道是为何只支持其中的部分频段。

因此**解决方法边上：**

将无线路由器的频段（信道）设置为10以下的，例如你可以设置9，完成之后，你就可以愉快的上网了！

快哉！
